# Задача 1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет,
# является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет
# Примечание: при решении задачи считаю, что выходным днями являются
# суббота (6 день недели) и воскресенье (7 день недели).

day_of_week = int(input('Введите номер дня недели (число от 1 до 7): '))
if day_of_week < 1 or day_of_week > 7:
    print('Введено значение вне диапазона от 1 до 7. Повторите попытку ввода.')
elif day_of_week >= 1 and  day_of_week < 6:
    print(f'День недели {day_of_week} не является выходным')
else:
    print(f'День недели {day_of_week} является выходным')